Revit 2027 API
BuiltInFailures.AutoRouteFailures.SpecifiedAnglesNotCompatibleWithLayoutError Property
 The specified angles are not compatible with current layout.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SpecifiedAnglesNotCompatibleWithLayoutError { get; }
Public Shared ReadOnly Property SpecifiedAnglesNotCompatibleWithLayoutError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SpecifiedAnglesNotCompatibleWithLayoutError {
	FailureDefinitionId^ get ();
}
static member SpecifiedAnglesNotCompatibleWithLayoutError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace